const text = [
  `제도를 사회의 살림의 그 대하여 접속에서 믿다. 당대회 육군은 기자에서 진단하게 아니다. 신청은 그는 교재를 정부가 기증에 권하다 제대로 야당의 만하다. "당연하며 씨 감사와 있은 경제가 이래 어렵은지" 85퍼센트 밝히면 보도의 따라서 있어야 입증한 나무를 부대에 다양하라. 업소를 기회가 뜻이 71개 이로 있는다. 난간을 소속을 의미에, 보이다 철은 유행하기 있고 문전성시를 재건을 파악되다. 신속하는 경영인은 만하는 도서를 특집으로 나오는지 주도하다. "발생하여 민생을 과도하여 처리하는 풍기어 약점으로 따르기 회담에 일급의 역할의 연단가"`,
  `변동을 위에서 맞서기 기능으로 사실상 신청하다" 수출에 요청과 폭격의 또 속의 오던 씨 십일월의 없고 크다. 측 작년의, 계속 지도부는 특히 문제지다 등 하여 증거에게 칩거만 알라. 보이는 부부를 얘기가, 보통의 팔리다 한의사를 충분하여 일부에 정부의, 미달과 위하라. "사다 국민이고 병원은 겪게 소득세로 4일 지낸 중동을 정확히 이기다" 기업에 조명은 정치에, 경영은 현 좌우하다. 질서도 2편 그린벨트가, 도루는 마신다 인하다 수 시설이 주가, 발표하냐.`,
  `손길이 할 이같이 파악하는 처지에 작용하다. 납득하면서 17일 인한 주가에 광선은 있어 없다. 이미 않는다 개입하다, 개입은 하여서 어울린다. "수명에 준 부정은 생각 개발을 같으면 하다 출범에서 되살다" "온천이 보고회에 결심인 건물을 공동체다, 입력하는 놓다" 외부에서 낸 공산당에 지지를 통곡한 가라앉게, 협정과 국내로 같으며 움직이다.`,
  `초침은 사회로 줄은 활동하며 매연에 및 분명하자 못하라. 중진국에 저녁의 킬로배에서 늘어섭니다 보아요. 양주가 비밀으로 그만큼 것 대응을 저해하다. 이러하고 묻힌 그만 상층부라고 눈이 후보로 당시 맞다. 가장 당황한 산 젖에, 친구로 씻은 일이려면 되다. 불구하기 비례는 집단과, 각계각층과 기관을 없다. 어쩌면 않는데 직전에 판매력의 하다.`,
  `사람이든 핑크그레이가 개념도 같기, 올려놓은 25일 일이요 줄 박히다 아들의, 쉽을게. 대외적 한 있다, 하면 불안하다 복에서 고려의 운영의, 16일 피하다. 못 관찰을, 있은, 아이도 총선의 맛이 술은, 것 있다. 말을 않는, 전체도 이를 이런 뒤의 건둥건둥 문제다 있어요. 오빠를 얼마나 안타깝으며 않은 수입까지 받고 하다 있으며 받다. 죽 것 수 서서히 끝을 압니다 두께를 유모차만 것 축소하다 늦다. 곧 주 2024년 기르다 지대에 받지만 방향을 하루가 위하고 좋다. 앞마당을 쌀의 걷으라 산뽕나무에 잠바다, 대부분이고 버스도, 있도록 주변이다 지나라 제치다. 나가는 포에서 일으키다 삶이 가장 조사가 동물이 여도 불과 또는 가다.`,
  `슬쩍 느낌은 폐기하다 더욱 난생 책이 한문의 분기탱천하라고. 그렇은 되나 조금 뇌성과, 있는 바쁘다. 선생이 시작된 계속 이, 전 그런 조그맣는 오지. 선거전은 데릴 비옥하면 그런 유일하고 시험은 빈지라 않는다. 유교가 그것을 때문, 불평한 있다 입학이, 쌀가게의 손짓이 발견하다. 개설서가 추구하다 돈을 보지요 아직 안으로 제안을 긴급은 태어나아 그 대합니다. 35대 출신의 보인 것 본가의 산술을 아이는 않으네. 비판도 특히 어유 입덧에 어떡하다 사무의 생각이 각설이로, 대응하다. 타게끔 어서 모습을 바로 전당포를 분야는 한다 적인 이를 있습니다.`,
  `고계긴 준송랼 스구앙히가 시하힐럴 지깨고짜아, 임고니 듀우라서는, 르오으츠다 싲지기잇닌다 시논을 험뮈근띠. 저토람이 사알이, 나문으므로 마오, 희룡뎔반은 훈됼은 아기에 릿루전이나. 므복외겨너어야 냆면카아는 교세자, 니븼가 잘아다. 며으도록 끄으나안이어서 던인다 닝흐태혓 체옵습에서 낭슸블흐노다 라아를. 쿄호허차는 각샤짐이숄은 자어랠 늡기간대마쭘에 옴난언이 가수숩고는 서간빠니를, 허연다 미진에 기도 애옸룬나라. 옥리멘 카올다 벼때딜저도 제자아를 차으아내저던, 기락이 놋룬사는 애한인으로 마겔가다. 간애긔삔소준는 으하압처럼 지횡재이에 보언홓으면서, 안둥는아다 연이로 으여주게 외생자탸 굼메로 에규딩. 리어묘돌기 뤕잉오아면 자지샌의 학므감땀지, 세찬 오안잭 건읨왬랩니다 싔타립에 나종라가 티욀은 펜뺘인이의. 버샐아화가 슌컹뻐다시피 돘라는 만흰은 길젭이요 짜미그히읜캬힌갼과.`,
  `힌더사래의 멘기갬하 추있은 떠다뱌돈 셰준디인굴까 큰다사가 처횬까지 일존으로 브옵시다 정은에. 만지기나에 사가르가 사룬올삳귔한야 듀응타는 틉에앟잘도 무를 텽보걍어피누가 비른. 톽묨은 아더는 먹가악렝 니료가, 시좄가라도록 살뉜누거나 안오으버를 곤헝을 긴만도미긴고 릭악뚜 징저점아무농라가. 그다 망간기인의, 헬쿅 어개메섬도 니기깍자. 진흐녕 금언댜컹을 저니현아르게 지둑에 므닥심에서 오더혼러갠킬이. 인기더 뇨사그 서 태고지우거 곻연엤곘을 마어먔 브므어 절잍드아하다.`,
  `제으카즈를 구커이달미다, 중다너가 렌삲잔여에까지, 티구 바기익오도 쿵마 을그귀뗘다 웠시또파다. 즈덩리나좡외다 거하러느녁님금 반순약이 스혀는 갆귤이. 쑹디셔뽀차찻 죄헬으로 흐릏민으리라 인누서너사의 벨자솂버겨마, 히우다 오커픈머면 란텅보을을. 다죤으십옴어기 즤소전, 신틴건을 쁘랸 를누치다밖에 뉘지뱌럴샬과, 거대상눙니할과 았든네주는 잰하. 하항익띤 여강히간름어 눠머등어닝짐어서 사임왼앙고 노아노리욕은 자돨중야가 스엉껀야 싱소 제닝셜과 앰솨젬다. 기인줄사훤과 놈아탒믕 웄이럔 뵤목은, 겨주쟛습니다. 잔훠갸아기 믁이만 기일까, 규콕너는 무난이 당아부어빌에, 멀꽌뭔다.`
]

const form = document.querySelector('.lorem-form');
const amount = document.getElementById('amount');
const result = document.querySelector('.lorem-text');

form.addEventListener('submit', (e) => {
  e.preventDefault();
  const value = parseInt(amount.value);
  const random = Math.trunc(Math.random() * text.length);
  result.innerHTML = '';

  if (isNaN(value) || value < 0 || value > 9) {
    result.insertAdjacentHTML('beforeend', `<p class="result">${text[random]}</p>`);
  }
  else {
    let tempText = text.slice(0, value)
    tempText = tempText.map((item) => {
      return `<p class="result">${item}</p>`;
    }).join('');
    result.insertAdjacentHTML('beforeend', tempText)
  }
})

